In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/processed/num_app_by_inventor_rank_state_county.tsv", sep="\t")
df.head()

   inventor_rank inventor_state inventor_county  num_application
0              1             AK  Aleutians East                1
1              1             AK  Aleutians West                2
2              1             AK       Anchorage              680
3              1             AK          Bethel                1
4              1             AK          Denali                4

In [6]:
c2f_df = pd.read_csv("../data/complementary/county2fips.tsv", sep="\t")
c2f_df.head()

   FIPS     Name State
0  1001  Autauga    AL
1  1003  Baldwin    AL
2  1005  Barbour    AL
3  1007     Bibb    AL
4  1009   Blount    AL

In [ ]:
df = pd.merge(df, c2f_df, )